{"nodes": [{"id": "hadiths", "group": "hadiths", "level": 1}, {"id": 0, "name": " 1 ", "group": "hadith", "level": 4, "text": "      Narrated 'Umar bin Al-Khattab:                          I heard Allah's Apostle saying, \"The reward of deeds depends upon the      intentions and every person will get the reward according to what he      has intended. So whoever emigrated for worldly benefits or for a woman     to marry, his emigration was for what he emigrated for.\""}, {"id": " Sahih Bukhari ", "name": " Sahih Bukhari ", "group": "source", "level": 2}, {"id": "Revelation - كتاب بدء الوحى", "name": "Revelation - كتاب بدء الوحى", "group": "chapter", "level": 3}, {"id": 1, "name": " 2 ", "group": "hadith", "level": 4, "text": "      Narrated 'Aisha:                          (the mother of the faithful believers) Al-Harith bin Hisham asked Allah's Apostle \"O Allah's Apostle! How is the Divine Inspiration revealed to you?\" Allah's Apostle replied, \"Sometimes it is (revealed) like the ringing of a bell, this form of Inspiration is the hardest of all and then this state passes off after I have grasped what is inspired. Sometimes the Angel comes in the form of a man and talks to me and I grasp whatever he says.\" 'Aisha added: Verily I saw the Prophet being inspired divinely on a very cold day and noticed the sweat dropping from his forehead (as the Inspiration was over)."}, {"id": 2, "name": " 3 ", "group": "hadith", "level": 4, "text": " Narrated 'Aisha:                       (the mother of the faithful believers) The commencement of the Divine Inspiration to Allah's Apostle was in the form of good dreams which came true like bright daylight, and then the love of seclusion was bestowed upon him. He used to go in seclusion in the cave of Hira where he used to worship (Allah alone) continuously for many days before his desire to see his family. He used to take with him the journey food for the stay and then come back to (his wife) Khadija to take his food likewise again till suddenly the Truth descended upon him while he was in the cave of Hira. The angel came to him and asked him to read. The Prophet replied, \"I do not know how to read.\" The Prophet added, \"The angel caught me (forcefully) and pressed me so hard that I could not bear it any more. He then released me and again asked me to read and I replied, 'I do not know how to read.' Thereupon he caught me again and pressed me a second time till I could not bear it any more. He then released me and again asked me to read but again I replied, 'I do not know how to read (or what shall I read)?' Thereupon he caught me for the third time and pressed me, and then released me and said, 'Read in the name of your Lord, who has created (all that exists), created man from a clot. Read! And your Lord is the Most Generous.\" (96.1, 96.2, 96.3) Then Allah's Apostle returned with the Inspiration and with his heart beating severely. Then he went to Khadija bint Khuwailid and said, \"Cover me! Cover me!\" They covered him till his fear was over and after that he told her everything that had happened and said, \"I fear that something may happen to me.\" Khadija replied, \"Never! By Allah, Allah will never disgrace you. You keep good relations with your kith and kin, help the poor and the destitute, serve your guests generously and assist the deserving calamity-afflicted ones.\"  Khadija then accompanied him to her cousin Waraqa bin Naufal bin Asad bin 'Abdul 'Uzza, who, during the pre-Islamic Period became a Christian and used to write the writing with Hebrew letters. He would write from the Gospel in Hebrew as much as Allah wished him to write. He was an old man and had lost his eyesight. Khadija said to Waraqa, \"Listen to the story of your nephew, O my cousin!\" Waraqa asked, \"O my nephew! What have you seen?\" Allah's Apostle described whatever he had seen. Waraqa said, \"This is the same one who keeps the secrets (angel Gabriel) whom Allah had sent to Moses. I wish I were young and could live up to the time when your people would turn you out.\" Allah's Apostle asked, \"Will they drive me out?\" Waraqa replied in the affirmative and said, \"Anyone (man) who came with something similar to what you have brought was treated with hostility; and if I should remain alive till the day when you will be turned out then I would support you strongly.\" But after a few days Waraqa died and the Divine Inspiration was also paused for a while."}, {"id": 3, "name": " 4 ", "group": "hadith", "level": 4, "text": " Narrated Jabir bin 'Abdullah Al-Ansari while talking about the period of pause in revelation reporting the speech of the Prophet \"While I was walking, all of a sudden I heard a voice from the sky. I looked up and saw the same angel who had visited me at the cave of Hira' sitting on a chair between the sky and the earth. I got afraid of him and came back home and said, 'Wrap me (in blankets).' And then Allah revealed the following Holy Verses (of Quran):                       'O you (i.e. Muhammad)! wrapped up in garments!' Arise and warn (the people against Allah's Punishment),... up to 'and desert the idols.' (74.1-5) After this the revelation started coming strongly, frequently and regularly.\""}, {"id": 4, "name": " 5 ", "group": "hadith", "level": 4, "text": "      Narrated Said bin Jubair:                          Ibn 'Abbas in the explanation of the statement of Allah \"Move not your tongue concerning (the Quran) to make haste therewith.\" (75.16) said \"Allah's Apostle used to bear the revelation with great trouble and used to move his lips (quickly) with the Inspiration.\" Ibn 'Abbas moved his lips saying, \"I am moving my lips in front of you as Allah's Apostle used to move his.\" Said moved his lips saying: \"I am moving my lips, as I saw Ibn 'Abbas moving his.\" Ibn 'Abbas added, \"So Allah revealed 'Move not your tongue concerning (the Qur'an) to make haste therewith. It is for Us to collect it and to give you (O Muhammad) the ability to recite it (the Quran)' (75.16-17) which means that Allah will make him (the Prophet) remember the portion of the Qur'an which was revealed at that time by heart and recite it. The statement of Allah: 'And when we have recited it to you (O Muhammad through Gabriel) then you follow its (Quran) recital' (75.18) means 'listen to it and be silent.' Then it is for Us (Allah) to make it clear to you' (75.19) means 'Then it is (for Allah) to make you recite it (and its meaning will be clear by itself through your tongue). Afterwards, Allah's Apostle used to listen to Gabriel whenever he came and after his departure he used to recite it as Gabriel had recited it.\""}, {"id": 5, "name": " 6 ", "group": "hadith", "level": 4, "text": "      Narrated Ibn 'Abbas:                          Allah's Apostle was the most generous of all the people, and he used      to reach the peak in generosity in the month of Ramadan when Gabriel      met him. Gabriel used to meet him every night of Ramadan to teach him      the Qur'an. Allah's Apostle was the most generous person, even more      generous than the strong uncontrollable wind (in readiness and haste      to do charitable deeds)."}, {"id": 6, "name": " 7 ", "group": "hadith", "level": 4, "text": "      Narrated 'Abdullah bin 'Abbas:                          Abu Sufyan bin Harb informed me that Heraclius had sent a messenger to     him while he had been accompanying a caravan from Quraish. They were      merchants doing business in Sham (Syria, Palestine, Lebanon and      Jordan), at the time when Allah's Apostle had truce with Abu Sufyan      and Quraish infidels. So Abu Sufyan and his companions went to      Heraclius at Ilya (Jerusalem). Heraclius called them in the court and      he had all the senior Roman dignitaries around him. He called for his      translator who, translating Heraclius's question said to them, \"Who      amongst you is closely related to that man who claims to be a      Prophet?\" Abu Sufyan replied, \"I am the nearest relative to him      (amongst the group).\"     Heraclius said, \"Bring him (Abu Sufyan) close to me and make his      companions stand behind him.\" Abu Sufyan added, Heraclius told his      translator to tell my companions that he wanted to put some questions      to me regarding that man (The Prophet) and that if I told a lie they      (my companions) should contradict me.\" Abu Sufyan added, \"By Allah!      Had I not been afraid of my companions labeling me a liar, I would not     have spoken the truth about the Prophet. The first question he asked      me about him was:     'What is his family status amongst you?'      I replied, 'He belongs to a good (noble) family amongst us.'      Heraclius further asked, 'Has anybody amongst you ever claimed the      same (i.e. to be a Prophet) before him?'     I replied, 'No.'     He said, 'Was anybody amongst his ancestors a king?'     I replied, 'No.'     Heraclius asked, 'Do the nobles or the poor follow him?'     I replied, 'It is the poor who follow him.'     He said, 'Are his followers increasing decreasing (day by day)?'     I replied, 'They are increasing.'     He then asked, 'Does anybody amongst those who embrace his religion      become displeased and renounce the religion afterwards?'     I replied, 'No.'     Heraclius said, 'Have you ever accused him of telling lies before his      claim (to be a Prophet)?'     I replied, 'No. '     Heraclius said, 'Does he break his promises?'     I replied, 'No. We are at truce with him but we do not know what he      will do in it.' I could not find opportunity to say anything against      him except that.     Heraclius asked, 'Have you ever had a war with him?'     I replied, 'Yes.'     Then he said, 'What was the outcome of the battles?'     I replied, 'Sometimes he was victorious and sometimes we.'     Heraclius said, 'What does he order you to do?'     I said, 'He tells us to worship Allah and Allah alone and not to      worship anything along with Him, and to renounce all that our      ancestors had said. He orders us to pray, to speak the truth, to be      chaste and to keep good relations with our Kith and kin.'     Heraclius asked the translator to convey to me the following, I asked      you about his family and your reply was that he belonged to a very      noble family. In fact all the Apostles come from noble families      amongst their respective peoples. I questioned you whether anybody      else amongst you claimed such a thing, your reply was in the negative.     If the answer had been in the affirmative, I would have thought that      this man was following the previous man's statement. Then I asked you      whether anyone of his ancestors was a king. Your reply was in the      negative, and if it had been in the affirmative, I would have thought      that this man wanted to take back his ancestral kingdom.     I further asked whether he was ever accused of telling lies before he      said what he said, and your reply was in the negative. So I wondered      how a person who does not tell a lie about others could ever tell a      lie about Allah. I, then asked you whether the rich people followed      him or the poor. You replied that it was the poor who followed him.      And in fact all the Apostle have been followed by this very class of      people. Then I asked you whether his followers were increasing or      decreasing. You replied that they were increasing, and in fact this is     the way of true faith, till it is complete in all respects. I further      asked you whether there was anybody, who, after embracing his      religion, became displeased and discarded his religion. Your reply was     in the negative, and in fact this is (the sign of) true faith, when      its delight enters the hearts and mixes with them completely. I asked      you whether he had ever betrayed. You replied in the negative and      likewise the Apostles never betray. Then I asked you what he ordered      you to do. You replied that he ordered you to worship Allah and Allah      alone and not to worship any thing along with Him and forbade you to      worship idols and ordered you to pray, to speak the truth and to be      chaste. If what you have said is true, he will very soon occupy this      place underneath my feet and I knew it (from the scriptures) that he      was going to appear but I did not know that he would be from you, and      if I could reach him definitely, I would go immediately to meet him      and if I were with him, I would certainly wash his feet.' Heraclius      then asked for the letter addressed by Allah's Apostle     which was delivered by Dihya to the Governor of Busra, who forwarded      it to Heraclius to read. The contents of the letter were as follows:      \"In the name of Allah the Beneficent, the Merciful (This letter is)      from Muhammad the slave of Allah and His Apostle to Heraclius the      ruler of Byzantine. Peace be upon him, who follows the right path.      Furthermore I invite you to Islam, and if you become a Muslim you will     be safe, and Allah will double your reward, and if you reject this      invitation of Islam you will be committing a sin by misguiding your      Arisiyin (peasants). (And I recite to you Allah's Statement:)     'O people of the scripture! Come to a word common to you and us that      we worship none but Allah and that we associate nothing in worship      with Him, and that none of us shall take others as Lords beside Allah.     Then, if they turn away, say: Bear witness that we are Muslims (those      who have surrendered to Allah).' (3:64).     Abu Sufyan then added, \"When Heraclius had finished his speech and had     read the letter, there was a great hue and cry in the Royal Court. So      we were turned out of the court. I told my companions that the      question of Ibn-Abi-Kabsha) (the Prophet Muhammad) has become so      prominent that even the King of Bani Al-Asfar (Byzantine) is afraid of     him. Then I started to become sure that he (the Prophet) would be the      conqueror in the near future till I embraced Islam (i.e. Allah guided      me to it).\"     The sub narrator adds, \"Ibn An-Natur was the Governor of llya'      (Jerusalem) and Heraclius was the head of the Christians of Sham. Ibn      An-Natur narrates that once while Heraclius was visiting ilya'      (Jerusalem), he got up in the morning with a sad mood. Some of his      priests asked him why he was in that mood? Heraclius was a foreteller      and an astrologer. He replied, 'At night when I looked at the stars, I     saw that the leader of those who practice circumcision had appeared      (become the conqueror). Who are they who practice circumcision?' The      people replied, 'Except the Jews nobody practices circumcision, so you     should not be afraid of them (Jews).     'Just Issue orders to kill every Jew present in the country.'     While they were discussing it, a messenger sent by the king of Ghassan     to convey the news of Allah's Apostle to Heraclius was brought in.      Having heard the news, he (Heraclius) ordered the people to go and see     whether the messenger of Ghassan was circumcised. The people, after      seeing him, told Heraclius that he was circumcised. Heraclius then      asked him about the Arabs. The messenger replied, 'Arabs also practice     circumcision.'     (After hearing that) Heraclius remarked that sovereignty of the 'Arabs     had appeared. Heraclius then wrote a letter to his friend in Rome who      was as good as Heraclius in knowledge. Heraclius then left for Homs.      (a town in Syrian and stayed there till he received the reply of his      letter from his friend who agreed with him in his opinion about the      emergence of the Prophet and the fact that he was a Prophet. On that      Heraclius invited all the heads of the Byzantines to assemble in his      palace at Homs. When they assembled, he ordered that all the doors of      his palace be closed. Then he came out and said, 'O Byzantines! If      success is your desire and if you seek right guidance and want your      empire to remain then give a pledge of allegiance to this Prophet      (i.e. embrace Islam).'     (On hearing the views of Heraclius) the people ran towards the gates      of the palace like onagers but found the doors closed. Heraclius      realized their hatred towards Islam and when he lost the hope of their     embracing Islam, he ordered that they should be brought back in      audience.     (When they returned) he said, 'What already said was just to test the      strength of your conviction and I have seen it.' The people prostrated     before him and became pleased with him, and this was the end of      Heraclius's story (in connection with his faith)."}, {"id": 7, "name": " 8 ", "group": "hadith", "level": 4, "text": "      Narrated Ibn 'Umar:                          Allah's Apostle said: Islam is based on (the following) five      (principles):     1. To testify that none has the right to be worshipped but Allah and      Muhammad is Allah's Apostle.     2. To offer the (compulsory congregational) prayers dutifully and      perfectly.     3. To pay Zakat (i.e. obligatory charity) .     4. To perform Hajj. (i.e. Pilgrimage to Mecca)     5. To observe fast during the month of Ramadan."}, {"id": "Belief - كتاب الإيمان", "name": "Belief - كتاب الإيمان", "group": "chapter", "level": 3}, {"id": 8, "name": " 9 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          The Prophet said, \"Faith (Belief) consists of more than sixty branches     (i.e. parts). And Haya (This term \"Haya\" covers a large number of      concepts which are to be taken together; amongst them are self      respect, modesty, bashfulness, and scruple, etc.) is a part of      faith.\""}, {"id": 9, "name": " 10 ", "group": "hadith", "level": 4, "text": "      Narrated 'Abdullah bin 'Amr:                          The Prophet said, \"A Muslim is the one who avoids harming Muslims with     his tongue and hands. And a Muhajir (emigrant) is the one who gives up     (abandons) all what Allah has forbidden.\""}, {"id": 10, "name": " 11 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Musa:                          Some people asked Allah's Apostle, \"Whose Islam is the best? i.e. (Who     is a very good Muslim)?\" He replied, \"One who avoids harming the      Muslims with his tongue and hands.\""}, {"id": 11, "name": " 12 ", "group": "hadith", "level": 4, "text": "      Narrated 'Abdullah bin 'Amr:                          A man asked the Prophet , \"What sort of deeds or (what qualities of)      Islam are good?\" The Prophet replied, 'To feed (the poor) and greet      those whom you know and those whom you do not Know (See      Hadith No. 27)."}, {"id": 12, "name": " 13 ", "group": "hadith", "level": 4, "text": "      Narrated Anas:                          The Prophet said, \"None of you will have faith till he wishes for his      (Muslim) brother what he likes for himself.\""}, {"id": 13, "name": " 14 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          \"Allah's Apostle said, \"By Him in Whose Hands my life is, none of you      will have faith till he loves me more than his father and his      children.\""}, {"id": 14, "name": " 15 ", "group": "hadith", "level": 4, "text": "      Narrated Anas:                          The Prophet said \"None of you will have faith till he loves me more      than his father, his children and all mankind.\""}, {"id": 15, "name": " 16 ", "group": "hadith", "level": 4, "text": "      Narrated Anas:                          The Prophet said, \"Whoever possesses the following three qualities      will have the sweetness (delight) of faith:     1. The one to whom Allah and His Apostle becomes dearer than anything      else.     2. Who loves a person and he loves him only for Allah's sake.     3. Who hates to revert to Atheism (disbelief) as he hates to be thrown     into the fire.\""}, {"id": 16, "name": " 17 ", "group": "hadith", "level": 4, "text": "      Narrated Anas:                          The Prophet said, \"Love for the Ansar is a sign of faith and hatred      for the Ansar is a sign of hypocrisy.\""}, {"id": 17, "name": " 18 ", "group": "hadith", "level": 4, "text": "      Narrated 'Ubada bin As-Samit:                          who took part in the battle of Badr and was a Naqib (a person heading      a group of six persons), on the night of Al-'Aqaba pledge: Allah's      Apostle said while a group of his companions were around him, \"Swear      allegiance to me for:     1. Not to join anything in worship along with Allah.     2. Not to steal.     3. Not to commit illegal sexual intercourse.     4. Not to kill your children.     5. Not to accuse an innocent person (to spread such an accusation      among people).     6. Not to be disobedient (when ordered) to do good deed.\"     The Prophet added: \"Whoever among you fulfills his pledge will be      rewarded by Allah. And whoever indulges in any one of them (except the     ascription of partners to Allah) and gets the punishment in this      world, that punishment will be an expiation for that sin. And if one      indulges in any of them, and Allah conceals his sin, it is up to Him      to forgive or punish him (in the Hereafter).\" 'Ubada bin As-Samit      added: \"So we swore allegiance for these.\" (points to Allah's      Apostle)"}, {"id": 18, "name": " 19 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Said Al-Khudri:                          Allah's Apostle said, \"A time will come that the best property of a      Muslim will be sheep which he will take on the top of mountains and      the places of rainfall (valleys) so as to flee with his religion from      afflictions.\""}, {"id": 19, "name": " 20 ", "group": "hadith", "level": 4, "text": "      Narrated 'Aisha:                          Whenever Allah's Apostle ordered the Muslims to do something, he used      to order them deeds which were easy for them to do, (according to      their strength endurance). They said, \"O Allah's Apostle! We are not      like you. Allah  has forgiven your past and future sins.\" So Allah's      Apostle became angry and it was apparent on his face. He said, \"I am      the most Allah fearing, and know Allah better than all of you do.\""}, {"id": 20, "name": " 21 ", "group": "hadith", "level": 4, "text": "      Narrated Anas:                          The Prophet said, \"Whoever possesses the following three qualities      will taste the sweetness of faith:     1. The one to whom Allah and His Apostle become dearer than anything      else.     2. Who loves a person and he loves him only for Allah's sake.     3. Who hates to revert to disbelief (Atheism) after Allah has brought      (saved) him out from it, as he hates to be thrown in fire.\""}, {"id": 21, "name": " 22 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Said Al-Khudri:                          The Prophet said, \"When the people of Paradise will enter Paradise and     the people of Hell will go to Hell, Allah will order those who have      had faith equal to the weight of a grain of mustard seed to be taken      out from Hell. So they will be taken out but (by then) they will be      blackened (charred). Then they will be put in the river of Haya'      (rain) or Hayat (life) (the Narrator is in doubt as to which is the      right term), and they will revive like a grain that grows near the      bank of a flood channel. Don't you see that it comes out yellow and      twisted\""}, {"id": 22, "name": " 23 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Said Al-Khudri:                          Allah's Apostle said, \"While I was sleeping I saw (in a dream) some      people wearing shirts of which some were reaching up to the breasts      only while others were even shorter than that. Umar bin Al-Khattab was     shown wearing a shirt that he was dragging.\" The people asked, \"How      did you interpret it? (What is its interpretation) O Allah's Apostle?\"     He (the Prophet ) replied, \"It is the Religion.\""}, {"id": 23, "name": " 24 ", "group": "hadith", "level": 4, "text": "      Narrated 'Abdullah (bin 'Umar):                          Once Allah's Apostle passed by an Ansari (man) who was admonishing to      his brother regarding Haya'. On that Allah's Apostle said, \"Leave him      as Haya' is a part of faith.\" (See Hadith No. 8)"}, {"id": 24, "name": " 25 ", "group": "hadith", "level": 4, "text": "      Narrated Ibn 'Umar:                          Allah's Apostle said: \"I have been ordered (by Allah) to fight against     the people until they testify that none has the right to be worshipped     but Allah and that Muhammad is Allah's Apostle, and offer the prayers      perfectly and give the obligatory charity, so if they perform that,      then they save their lives and property from me except for Islamic laws     and then their reckoning (accounts) will be done by Allah.\""}, {"id": 25, "name": " 26 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          Allah's Apostle was asked, \"What is the best deed?\" He replied, \"To      believe in Allah and His Apostle (Muhammad). The questioner then      asked, \"What is the next (in goodness)? He replied, \"To participate in     Jihad (religious fighting) in Allah's Cause.\" The questioner again      asked, \"What is the next (in goodness)?\" He replied, \"To perform Hajj      (Pilgrim age to Mecca) 'Mubrur, (which is accepted by Allah and is      performed with the intention of seeking Allah's pleasure only and not      to show off and without committing a sin and in accordance with the      traditions of the Prophet).\""}, {"id": 26, "name": " 27 ", "group": "hadith", "level": 4, "text": "      Narrated Sa'd:                          Allah's Apostle distributed (Zakat) amongst (a group of) people while      I was sitting there but Allah's Apostle left a man whom I thought the      best of the lot. I asked, \"O Allah's Apostle! Why have you left that      person? By Allah I regard him as a faithful believer.\" The Prophet      commented: \"Or merely a Muslim.\" I remained quiet for a while, but      could not help repeating my question because of what I knew about him.     And then asked Allah's Apostle, \"Why have you left so and so? By      Allah! He is a faithful believer.\" The Prophet again said, \"Or merely      a Muslim.\" And I could not help repeating my question because of what      I knew about him. Then the Prophet said, \"O Sa'd! I give to a person      while another is dearer to me, for fear that he might be thrown on his     face in the Fire by Allah.\""}, {"id": 27, "name": " 28 ", "group": "hadith", "level": 4, "text": "      Narrated 'Abdullah bin 'Amr:                          A person asked Allah's Apostle . \"What (sort of) deeds in or (what      qualities of) Islam are good?\" He replied, \"To feed (the poor) and      greet those whom you know and those whom you don't know.\""}, {"id": 28, "name": " 29 ", "group": "hadith", "level": 4, "text": "      Narrated Ibn 'Abbas:                          The Prophet said: \"I was shown the Hell-fire and that the majority of      its dwellers were women who were ungrateful.\" It was asked, \"Do they      disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied,      \"They are ungrateful to their husbands and are ungrateful for the      favors and the good (charitable deeds) done to them. If you have      always been good (benevolent) to one of them and then she sees      something in you (not of her liking), she will say, 'I have never      received any good from you.\""}, {"id": 29, "name": " 30 ", "group": "hadith", "level": 4, "text": "      Narrated Al-Ma'rur:                          At Ar-Rabadha I met Abu Dhar who was wearing a cloak, and his slave,      too, was wearing a similar one. I asked about the reason for it. He      replied, \"I abused a person by calling his mother with bad names.\" The     Prophet said to me, 'O Abu Dhar! Did you abuse him by calling his      mother with bad names You still have some characteristics of      ignorance. Your slaves are your brothers and Allah has put them under      your command. So whoever has a brother under his command should feed      him of what he eats and dress him of what he wears. Do not ask them      (slaves) to do things beyond their capacity (power) and if you do so,      then help them.' \""}, {"id": 30, "name": " 31 ", "group": "hadith", "level": 4, "text": "      Narrated Al-Ahnaf bin Qais:                          While I was going to help this man ('Ali Ibn Abi Talib), Abu Bakra met     me and asked, \"Where are you going?\" I replied, \"I am going to help      that person.\" He said, \"Go back for I have heard Allah's Apostle      saying, 'When two Muslims fight (meet) each other with their swords,      both the murderer as well as the murdered will go to the Hell-fire.' I     said, 'O Allah's Apostle! It is all right for the murderer but what      about the murdered one?' Allah's Apostle replied, \"He surely had the      intention to kill his companion.\""}, {"id": 31, "name": " 32 ", "group": "hadith", "level": 4, "text": "      Narrated 'Abdullah:                          When the following Verse was revealed: \"It is those who believe and      confuse not their belief with wrong (worshipping others besides      Allah.)\" (6:83), the companions of Allah's Apostle asked, \"Who is      amongst us who had not done injustice (wrong)?\" Allah revealed: \"No      doubt, joining others in worship with Allah is a great injustice      (wrong) indeed.\" (31.13)"}, {"id": 32, "name": " 33 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          The Prophet said, \"The signs of a hypocrite are three:     1. Whenever he speaks, he tells a lie.     2. Whenever he promises, he always breaks it (his promise ).     3. If you trust him, he proves to be dishonest. (If you keep something     as a trust with him, he will not return it.)\""}, {"id": 33, "name": " 34 ", "group": "hadith", "level": 4, "text": "      Narrated 'Abdullah bin 'Amr:                          The Prophet said, \"Whoever has the following four (characteristics)      will be a pure hypocrite and whoever has one of the following four      characteristics will have one characteristic of hypocrisy unless and      until he gives it up.     1. Whenever he is entrusted, he betrays.     2. Whenever he speaks, he tells a lie.     3. Whenever he makes a covenant, he proves treacherous.     4. Whenever he quarrels, he behaves in a very imprudent, evil and      insulting manner.\""}, {"id": 34, "name": " 35 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          Allah's Apostle said, \"Whoever establishes the prayers on the night of     Qadr out of sincere faith and hoping to attain Allah's rewards (not to     show off) then all his past sins will be forgiven.\""}, {"id": 35, "name": " 36 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          The Prophet said, \"The person who participates in (Holy battles) in      Allah's cause and nothing compels him to do so except belief in Allah      and His Apostles, will be recompensed by Allah either with a reward,      or booty (if he survives) or will be admitted to Paradise (if he is      killed in the battle as a martyr). Had I not found it difficult for my     followers, then I would not remain behind any sariya going for Jihad      and I would have loved to be martyred in Allah's cause and then made      alive, and then martyred and then made alive, and then again martyred      in His cause.\""}, {"id": 36, "name": " 37 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          Allah's Apostle said: \"Whoever establishes prayers during the nights      of Ramadan faithfully out of sincere faith and hoping to attain      Allah's rewards (not for showing off), all his past sins will be      forgiven.\""}, {"id": 37, "name": " 38 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          Allah's Apostle said, \"Whoever observes fasts during the month of      Ramadan out of sincere faith, and hoping to attain Allah's rewards,      then all his past sins will be forgiven.\""}, {"id": 38, "name": " 39 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          The Prophet said, \"Religion is very easy and whoever overburdens      himself in his religion will not be able to continue in that way. So      you should not be extremists, but try to be near to perfection and      receive the good tidings that you will be rewarded; and gain strength      by worshipping in the mornings, the nights.\" (See Fath-ul-Bari, Page      102, Vol 1)."}, {"id": 39, "name": " 40 ", "group": "hadith", "level": 4, "text": "      Narrated Al-Bara' (bin 'Azib):                          When the Prophet came to Medina, he stayed first with his grandfathers     or maternal uncles from Ansar. He offered his prayers facing      Baitul-Maqdis (Jerusalem) for sixteen or seventeen months, but he      wished that he could pray facing the Ka'ba (at Mecca). The first      prayer which he offered facing the Ka'ba was the 'Asr prayer in the      company of some people. Then one of those who had offered that prayer      with him came out and passed by some people in a mosque who were      bowing during their prayers (facing Jerusalem). He said addressing      them, \"By Allah, I testify that I have prayed with Allah's Apostle      facing Mecca (Ka'ba).' Hearing that, those people changed their      direction towards the Ka'ba immediately. Jews and the people of the      scriptures used to be pleased to see the Prophet facing Jerusalem in      prayers but when he changed his direction towards the Ka'ba, during      the prayers, they disapproved of it.     Al-Bara' added, \"Before we changed our direction towards the Ka'ba      (Mecca) in prayers, some Muslims had died or had been killed and we      did not know what to say about them (regarding their prayers.) Allah      then revealed: And Allah would never make your faith (prayers) to be      lost (i.e. the prayers of those Muslims were valid).' \" (2:143)."}, {"id": 40, "name": " 41 ", "group": "hadith", "level": 4, "text": " Narrated Abu Sa'id Al Khudri:                     Allah's Messenger () said, \"If a person embraces Islam sincerely, then Allah shall forgive all his past sins, and after that starts the settlement of accounts, the reward of his good deeds will be ten times to seven hundred times for each good deed and one evil deed will be recorded as it is unless Allah forgives it.\""}, {"id": 41, "name": " 42 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          Allah's Apostle said, \"If any one of you improve (follows strictly)      his Islamic religion then his good deeds will be rewarded ten times to     seven hundred times for each good deed and a bad deed will be recorded     as it is.\""}, {"id": 42, "name": " 43 ", "group": "hadith", "level": 4, "text": "      Narrated 'Aisha:                          Once the Prophet came while a woman was sitting with me. He said, \"Who     is she?\" I replied, \"She is so and so,\" and told him about her      (excessive) praying. He said disapprovingly, \"Do (good) deeds which is     within your capacity (without being overtaxed) as Allah does not get      tired (of giving rewards) but (surely) you will get tired and the best     deed (act of Worship) in the sight of Allah is that which is done      regularly.\""}, {"id": 43, "name": " 44 ", "group": "hadith", "level": 4, "text": "      Narrated Anas:                          The Prophet said, \"Whoever said \"None has the right to be worshipped      but Allah and has in his heart good (faith) equal to the weight of a      barley grain will be taken out of Hell. And whoever said: \"None has      the right to be worshipped but Allah and has in his heart good (faith)     equal to the weight of a wheat grain will be taken out of Hell. And      whoever said, \"None has the right to be worshipped but Allah and has      in his heart good (faith) equal to the weight of an atom will be taken     out of Hell.\""}, {"id": 44, "name": " 45 ", "group": "hadith", "level": 4, "text": "      Narrated 'Umar bin Al-Khattab:                          Once a Jew said to me, \"O the chief of believers! There is a verse in      your Holy Book Which is read by all of you (Muslims), and had it been      revealed to us, we would have taken that day (on which it was revealed     as a day of celebration.\" 'Umar bin Al-Khattab asked, \"Which is that      verse?\" The Jew replied, \"This day I have perfected your religion For      you, completed My favor upon you, And have chosen for you Islam as      your religion.\" (5:3) 'Umar replied,\"No doubt, we know when and where      this verse was revealed to the Prophet. It was Friday and the Prophet      was standing at 'Arafat (i.e. the Day of Hajj)\""}, {"id": 45, "name": " 46 ", "group": "hadith", "level": 4, "text": "      Narrated Talha bin 'Ubaidullah:                          A man from Najd with unkempt hair came to Allah's Apostle and we heard     his loud voice but could not understand what he was saying, till he      came near and then we came to know that he was asking about Islam.      Allah's Apostle said, \"You have to offer prayers perfectly five times      in a day and night (24 hours).\" The man asked, \"Is there any more      (praying)?\" Allah's Apostle replied, \"No, but if you want to offer the     Nawafil prayers (you can).\" Allah's Apostle further said to him: \"You      have to observe fasts during the month of Ramadan.\" The man asked,      \"Is there any more fasting?\" Allah's Apostle replied, \"No, but if you      want to observe the Nawafil fasts (you can.)\" Then Allah's Apostle      further said to him, \"You have to pay the Zakat (obligatory charity).\"     The man asked, \"Is there any thing other than the Zakat for me to      pay?\" Allah's Apostle replied, \"No, unless you want to give alms of      your own.\" And then that man retreated saying, \"By Allah! I will      neither do less nor more than this.\" Allah's Apostle said, \"If what he     said is true, then he will be successful (i.e. he will be granted      Paradise).\""}, {"id": 46, "name": " 47 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          Allah's Apostle said, \"(A believer) who accompanies the funeral      procession of a Muslim out of sincere faith and hoping to attain      Allah's reward and remains with it till the funeral prayer is offered      and the burial ceremonies are over, he will return with a reward of      two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who      offers the funeral prayer only and returns before the burial, will      return with the reward of one Qirat only.\""}, {"id": 47, "name": " 48 ", "group": "hadith", "level": 4, "text": "      Narrated 'Abdullah:                          The Prophet said, \"Abusing a Muslim is Fusuq (an evil doing) and      killing him is Kufr (disbelief).\""}, {"id": 48, "name": " 49 ", "group": "hadith", "level": 4, "text": " Narrated 'Ubada bin As-Samit:                           \"Allah's Apostle went out to inform the people about the (date of the)     night of decree (Al-Qadr) but there happened a quarrel between two      Muslim men. The Prophet said, \"I came out to inform you about (the      date of) the night of Al-Qadr, but as so and so and so and so      quarrelled, its knowledge was taken away (I forgot it) and maybe it      was better for you. Now look for it in the 7th, the 9th and the 5th      (of the last 10 nights of the month of Ramadan).\""}, {"id": 49, "name": " 50 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Huraira:                          One day while the Prophet was sitting in the company of some people,      (The angel) Gabriel came and asked, \"What is faith?\" Allah's Apostle      replied, 'Faith is to believe in Allah, His angels, (the) meeting with     Him, His Apostles, and to believe in Resurrection.\" Then he further      asked, \"What is Islam?\" Allah's Apostle replied, \"To worship Allah      Alone and none else, to offer prayers perfectly to pay the compulsory      charity (Zakat) and to observe fasts during the month of Ramadan.\"       Then he further asked, \"What is Ihsan (perfection)?\" Allah's Apostle      replied, \"To worship Allah as if you see Him, and if you cannot      achieve this state of devotion then you must consider that He is      looking at you.\" Then he further asked, \"When will the Hour be      established?\" Allah's Apostle replied, \"The answerer has no better      knowledge than the questioner. But I will inform you about its      portents.     1. When a slave (lady) gives birth to her master.     2. When the shepherds of black camels start boasting and competing      with others in the construction of higher buildings. And the Hour is      one of five things which nobody knows except Allah.     The Prophet then recited: \"Verily, with Allah (Alone) is the knowledge     of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet      asked his companions to call him back, but they could not see him.      Then the Prophet said, \"That was Gabriel who came to teach the people      their religion.\" Abu 'Abdullah said: He (the Prophet) considered all      that as a part of faith."}, {"id": 50, "name": " 51 ", "group": "hadith", "level": 4, "text": "      Narrated 'Abdullah bin 'Abbas:                          I was informed by Abu Sufyan that Heraclius said to him, \"I asked you      whether they (followers of Muhammad) were increasing or decreasing.      You replied that they were increasing. And in fact, this is the way of     true Faith till it is complete in all respects. I further asked you      whether there was anybody, who, after embracing his (the Prophets)      religion (Islam) became displeased and discarded it. You replied in      the negative, and in fact, this is (a sign of) true faith. When its      delight enters the heart and mixes with them completely, nobody can be     displeased with it.\""}, {"id": 51, "name": " 52 ", "group": "hadith", "level": 4, "text": "      Narrated An-Nu'man bin Bashir:                          I heard Allah's Apostle saying, 'Both legal and illegal things are      evident but in between them there are doubtful (suspicious) things and     most of the people have no knowledge about them. So whoever saves      himself from these suspicious things saves his religion and his honor.     And whoever indulges in these suspicious things is like a shepherd who     grazes (his animals) near the Hima (private pasture) of someone else      and at any moment he is liable to get in it. (O people!) Beware! Every     king has a Hima and the Hima of Allah on the earth is His illegal      (forbidden) things. Beware! There is a piece of flesh in the body if      it becomes good (reformed) the whole body becomes good but if it gets      spoilt the whole body gets spoilt and that is the heart."}, {"id": 52, "name": " 53 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Jamra:                          I used to sit with Ibn 'Abbas and he made me sit on his sitting place.     He requested me to stay with him in order that he might give me a      share from his property. So I stayed with him for two months. Once he      told (me) that when the delegation of the tribe of 'Abdul Qais came to     the Prophet, the Prophet asked them, \"Who are the people (i.e. you)?      (Or) who are the delegate?\" They replied, \"We are from the tribe of      Rabi'a.\" Then the Prophet said to them, \"Welcome! O people (or O      delegation of 'Abdul Qais)! Neither will you have disgrace nor will      you regret.\" They said, \"O Allah's Apostle! We cannot come to you      except in the sacred month and there is the infidel tribe of Mudar      intervening between you and us. So please order us to do something      good (religious deeds) so that we may inform our people whom we have      left behind (at home), and that we may enter Paradise (by acting on      them).\" Then they asked about drinks (what is legal and what is      illegal). The Prophet ordered them to do four things and forbade them      from four things. He ordered them to believe in Allah Alone and asked      them, \"Do you know what is meant by believing in Allah Alone?\" They      replied, \"Allah and His Apostle know better.\" Thereupon the Prophet      said, \"It means:     1. To testify that none has the right to be worshipped but Allah and      Muhammad is Allah's Apostle.      2. To offer prayers perfectly     3. To pay the Zakat (obligatory charity)      4. To observe fast during the month of Ramadan.     5. And to pay Al-Khumus (one fifth of the booty to be given in Allah's     Cause).     Then he forbade them four things, namely, Hantam, Dubba,' Naqir Ann      Muzaffat or Muqaiyar; (These were the names of pots in which Alcoholic     drinks were prepared) (The Prophet mentioned the container of wine and     he meant the wine itself). The Prophet further said (to them):      \"Memorize them (these instructions) and convey them to the people whom     you have left behind.\""}, {"id": 53, "name": " 54 ", "group": "hadith", "level": 4, "text": "      Narrated 'Umar bin Al-Khattab:                          Allah's Apostle said, \"The reward of deeds depends upon the intention      and every person will get the reward according to what he has      intended. So whoever emigrated for Allah and His Apostle, then his      emigration was for Allah and His Apostle. And whoever emigrated for      worldly benefits or for a woman to marry, his emigration was for what      he emigrated for.\""}, {"id": 54, "name": " 55 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Mas'ud:                          The Prophet said, \"If a man spends on his family (with the intention      of having a reward from Allah) sincerely for Allah's sake then it is a     (kind of) alms-giving in reward for him."}, {"id": 55, "name": " 56 ", "group": "hadith", "level": 4, "text": "      Narrated Sa'd bin Abi Waqqas:                          Allah's Apostle said, \"You will be rewarded for whatever you spend for     Allah's sake even if it were a morsel which you put in your wife's      mouth.\""}, {"id": 56, "name": " 57 ", "group": "hadith", "level": 4, "text": "      Narrated Jarir bin Abdullah:                          I gave the pledge of allegiance to Allah's Apostle for the following:     1. offer prayers perfectly      2. pay the Zakat (obligatory charity)     3. and be sincere and true to every Muslim."}, {"id": 57, "name": " 58 ", "group": "hadith", "level": 4, "text": "      Narrated Ziyad bin'Ilaqa:                          I heard Jarir bin 'Abdullah (Praising Allah). On the day when      Al-Mughira bin Shu'ba died, he (Jarir) got up (on the pulpit) and      thanked and praised Allah and said, \"Be afraid of Allah alone Who has      none along with Him to be worshipped.(You should) be calm and quiet      till the (new) chief comes to you and he will come to you soon. Ask      Allah's forgiveness for your (late) chief because he himself loved to      forgive others.\" Jarir added, \"Amma badu (now then), I went to the      Prophet and said, 'I give my pledge of allegiance to you for Islam.\"      The Prophet conditioned (my pledge) for me to be sincere and true to      every Muslim so I gave my pledge to him for this. By the Lord of this      mosque! I am sincere and true to you (Muslims). Then Jarir asked for      Allah's forgiveness and came down (from the pulpit)."}, {"id": 58, "name": " 59 ", "group": "hadith", "level": 4, "text": " Narrated Abu Huraira:                     While the Prophet was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Apostle continued his talk, so some people said that Allah's Apostle had heard the question, but did not like what that Bedouin had asked. Some of them said that Allah's Apostle had not heard it. When the Prophet finished his speech, he said, \"Where is the questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\""}, {"id": "Knowledge - كتاب العلم", "name": "Knowledge - كتاب العلم", "group": "chapter", "level": 3}, {"id": 59, "name": " 60 ", "group": "hadith", "level": 4, "text": " Narrated `Abdullah bin `Amr:                     Once the Prophet remained behind us in a journey. He joined us while we were performing ablution for the prayer which was over-due. We were just passing wet hands over our feet (and not washing them properly) so the Prophet addressed us in a loud voice and said twice or thrice: \"Save your heels from the fire.\""}, {"id": 60, "name": " 61 ", "group": "hadith", "level": 4, "text": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree but felt shy to answer the others then asked, \"What is that tree, O Allah's Apostle ?\" He replied, \"It is the date-palm tree.\""}, {"id": 61, "name": " 62 ", "group": "hadith", "level": 4, "text": " Narrated Ibn `Umar:                     The Prophet said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree. The others then asked, \"Please inform us what is that tree, O Allah's Apostle?\" He replied, \"It is the date-palm tree.\""}, {"id": 62, "name": " 63 ", "group": "hadith", "level": 4, "text": " Narrated Anas bin Malik:                     While we were sitting with the Prophet in the mosque, a man came riding on a camel. He made his camel kneel down in the mosque, tied its foreleg and then said: \"Who amongst you is Muhammad?\" At that time the Prophet was sitting amongst us (his companions) leaning on his arm. We replied, \"This white man reclining on his arm.\" The man then addressed him, \"O Son of `Abdul Muttalib.\" The Prophet said, \"I am here to answer your questions.\" The man said to the Prophet, \"I want to ask you something and will be hard in questioning. So do not get angry.\" The Prophet said, \"Ask whatever you want.\" The man said, \"I ask you by your Lord, and the Lord of those who were before you, has Allah sent you as an Apostle to all the mankind?\" The Prophet replied, \"By Allah, yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to offer five prayers in a day and night (24 hours).? He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah! Has Allah ordered you to observe fasts during this month of the year (i.e. Ramadan)?\" He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to take Zakat (obligatory charity) from our rich people and distribute it amongst our poor people?\" The Prophet replied, \"By Allah, yes.\" Thereupon that man said, \"I have believed in all that with which you have been sent, and I have been sent by my people as a messenger, and I am Dimam bin Tha`laba from the brothers of Bani Sa`d bin Bakr.\""}, {"id": 63, "name": " 64 ", "group": "hadith", "level": 4, "text": " Narrated `Abdullah bin `Abbas:                     Once Allah's Apostle gave a letter to a person and ordered him to go and deliver it to the Governor of Bahrain. (He did so) and the Governor of Bahrain sent it to Chousroes, who read that letter and then tore it to pieces. (The sub-narrator (Ibn Shihab) thinks that Ibn Al-Musaiyab said that Allah's Apostle invoked Allah against them (saying), \"May Allah tear them into pieces, and disperse them all totally.)\""}, {"id": 64, "name": " 65 ", "group": "hadith", "level": 4, "text": " Narrated Anas bin Malik:                     Once the Prophet wrote a letter or had an idea of writing a letter. The Prophet was told that they (rulers) would not read letters unless they were sealed. So the Prophet got a silver ring made with \"Muhammad Allah's Apostle\" engraved on it. As if I were just observing its white glitter in the hand of the Prophet."}, {"id": 65, "name": " 66 ", "group": "hadith", "level": 4, "text": " Narrated Abu Waqid Al-Laithi:                     While Allah's Apostle was sitting in the mosque with some people, three men came. Two of them came in front of Allah's Apostle and the third one went away. The two persons kept on standing before Allah's Apostle for a while and then one of them found a place in the circle and sat there while the other sat behind the gathering, and the third one went away. When Allah's Apostle finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah, so Allah took him into His grace and mercy and accommodated him, the second felt shy from Allah, so Allah sheltered Him in His mercy (and did not punish him), while the third turned his face from Allah and went away, so Allah turned His face from him likewise. \""}, {"id": 66, "name": " 67 ", "group": "hadith", "level": 4, "text": " Narrated `Abdur-Rahman bin Abi Bakra's father:                     Once the Prophet was riding his camel and a man was holding its rein. The Prophet asked, \"What is the day today?\" We kept quiet, thinking that he might give that day another name. He said, \"Isn't it the day of Nahr (slaughtering of the animals of sacrifice)\" We replied, \"Yes.\" He further asked, \"Which month is this?\" We again kept quiet, thinking that he might give it another name. Then he said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" He said, \"Verily! Your blood, property and honor are sacred to one another (i.e. Muslims) like the sanctity of this day of yours, in this month of yours and in this city of yours. It is incumbent upon those who are present to inform those who are absent because those who are absent might comprehend (what I have said) better than the present audience.\""}, {"id": 67, "name": " 68 ", "group": "hadith", "level": 4, "text": " Narrated Ibn Mas`ud:                     The Prophet used to take care of us in preaching by selecting a suitable time, so that we might not get bored. (He abstained from pestering us with sermons and knowledge all the time)."}, {"id": 68, "name": " 69 ", "group": "hadith", "level": 4, "text": " Narrated Anas bin Malik:                     The Prophet said, \"Facilitate things to people (concerning religious matters), and do not make it hard for them and give them good tidings and do not make them run away (from Islam)."}, {"id": 69, "name": " 70 ", "group": "hadith", "level": 4, "text": " Narrated Abu Wail:                     `Abdullah used to give a religious talk to the people on every Thursday. Once a man said, \"O Aba `Abdur-Rahman! (By Allah) I wish if you could preach us daily.\" He replied, \"The only thing which prevents me from doing so, is that I hate to bore you, and no doubt I take care of you in preaching by selecting a suitable time just as the Prophet used to do with us, for fear of making us bored.\""}, {"id": 70, "name": " 71 ", "group": "hadith", "level": 4, "text": " Narrated Muawiya:                     I heard Allah's Apostle saying, \"If Allah wants to do good to a person, He makes him comprehend the religion. I am just a distributor, but the grant is from Allah. (And remember) that this nation (true Muslims) will keep on following Allah's teachings strictly and they will not be harmed by any one going on a different path till Allah's order (Day of Judgment) is established.\""}, {"id": 71, "name": " 72 ", "group": "hadith", "level": 4, "text": " Narrated Ibn `Umar:                     We were with the Prophet and fresh dates of a palm tree were brought to him. On that he said, \"Amongst the trees, there is a tree which resembles a Muslim.\" I wanted to say that it was the datepalm tree but as I was the youngest of all (of them) I kept quiet. And then the Prophet said, \"It is the date-palm tree.\""}, {"id": 72, "name": " 73 ", "group": "hadith", "level": 4, "text": " Narrated `Abdullah bin Mas`ud:                     The Prophet said, \"Do not wish to be like anyone except in two cases. (The first is) A person, whom Allah has given wealth and he spends it righteously; (the second is) the one whom Allah has given wisdom (the Holy Qur'an) and he acts according to it and teaches it to others.\" (Fath-al-Bari page 177 Vol. 1)"}, {"id": 73, "name": " 74 ", "group": "hadith", "level": 4, "text": " Narrated Ibn `Abbas:                     That he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of (the Prophet) Moses. Ibn `Abbas said that he was Al Khadir. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him, saying \"My friend (Hur) and I have differed regarding Moses' companion, whom Moses asked the way to meet. Have you heard the Prophet mentioning something about him? He said, \"Yes. I heard Allah's Apostle saying, \"While Moses was sitting in the company of some Israelites, a man came and asked him. \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: 'Yes, Our slave Khadir (is more learned than you.)' Moses asked (Allah) how to meet him (Khadir). So Allah made the fish as a sign for him and he was told that when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said to him: Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said: 'That is what we have been seeking? (18.64) So they went back retracing their footsteps, and found Khadir. (And) what happened further to them is narrated in the Holy Qur'an by Allah. (18.54 up to 18.82)"}, {"id": 74, "name": " 75 ", "group": "hadith", "level": 4, "text": " Narrated Ibn `Abbas:                     Once the Prophet embraced me and said, \"O Allah! Bestow on him the knowledge of the Book (Qur'an)."}, {"id": 75, "name": " 76 ", "group": "hadith", "level": 4, "text": " Narrated Ibn `Abbas:                     Once I came riding a she-ass and had (just) attained the age of puberty. Allah's Apostle was offering the prayer at Mina. There was no wall in front of him and I passed in front of some of the row while they were offering their prayers. There I let the she-ass loose to graze and entered the row, and nobody objected to it."}, {"id": 76, "name": " 77 ", "group": "hadith", "level": 4, "text": " Narrated Mahmud bin Rabi`a:                     When I was a boy of five, I remember, the Prophet took water from a bucket (used far getting water out of a well) with his mouth and threw it on my face."}, {"id": 77, "name": " 78 ", "group": "hadith", "level": 4, "text": " Narrated Ibn `Abbas:                     that he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of the Prophet Moses. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \"My friend (Hur) and I have differed regarding Moses' companion whom Moses asked the way to meet. Have you heard Allah's Apostle mentioning something about him? Ubai bin Ka`b said: \"Yes, I heard the Prophet mentioning something about him (saying) while Moses was sitting in the company of some Israelites, a man came and asked him: \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: '--Yes, Our slave Khadir is more learned than you. Moses asked Allah how to meet him (Al-Khadir). So Allah made the fish a sign for him and he was told when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said: 'Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said, 'That is what we have been seeking.' So they went back retracing their footsteps, and found Khadir. (and) what happened further about them is narrated in the Holy Qur'an by Allah.\" (18.54 up to 18.82)"}, {"id": 78, "name": " 79 ", "group": "hadith", "level": 4, "text": " Narrated Abu Musa:                     The Prophet said, \"The example of guidance and knowledge with which Allah has sent me is like abundant rain falling on the earth, some of which was fertile soil that absorbed rain water and brought forth vegetation and grass in abundance. (And) another portion of it was hard and held the rain water and Allah benefited the people with it and they utilized it for drinking, making their animals drink from it and for irrigation of the land for cultivation. (And) a portion of it was barren which could neither hold the water nor bring forth vegetation (then that land gave no benefits). The first is the example of the person who comprehends Allah's religion and gets benefit (from the knowledge) which Allah has revealed through me (the Prophets and learns and then teaches others. The last example is that of a person who does not care for it and does not take Allah's guidance revealed through me (He is like that barren land.)\""}, {"id": 79, "name": " 80 ", "group": "hadith", "level": 4, "text": " Narrated Anas:                     Allah's Apostle said, \"From among the portents of the Hour are (the following): -1. Religious knowledge will be taken away (by the death of Religious learned men). -2. (Religious) ignorance will prevail. -3. Drinking of Alcoholic drinks (will be very common). -4. There will be prevalence of open illegal sexual intercourse."}, {"id": 80, "name": " 81 ", "group": "hadith", "level": 4, "text": " Narrated Anas:                     I will narrate to you a Hadith and none other than I will tell you about after it. I heard Allah's Apostle saying: From among the portents of the Hour are (the following): -1. Religious knowledge will decrease (by the death of religious learned men). -2. Religious ignorance will prevail. -3. There will be prevalence of open illegal sexual intercourse. -4. Women will increase in number and men will decrease in number so much so that fifty women will be looked after by one man."}, {"id": 81, "name": " 82 ", "group": "hadith", "level": 4, "text": " Narrated Ibn `Umar:                     Allah's Apostle said, \"While I was sleeping, I saw that a cup full of milk was brought to me and I drank my fill till I noticed (the milk) its wetness coming out of my nails. Then I gave the remaining milk to `Umar Ibn Al-Khattab\" The companions of the Prophet asked, \"What have you interpreted (about this dream)? \"O Allah's Apostle ,!\" he replied, \"(It is religious) knowledge.\""}, {"id": 82, "name": " 83 ", "group": "hadith", "level": 4, "text": " Narrated `Abdullah bin `Amr bin Al `Aas:                     Allah's Apostle stopped (for a while near the Jimar) at Mina during his last Hajj for the people and they were asking him questions. A man came and said, \"I forgot and got my head shaved before slaughtering the Hadi (sacrificing animal).\" The Prophet said, \"There is no harm, go and do the slaughtering now.\" Then another person came and said, \"I forgot and slaughtered (the camel) before Rami (throwing of the pebbles) at the Jamra.\" The Prophet said, \"Do the Rami now and there is no harm.\" The narrator added: So on that day, when the Prophet was asked about anything (as regards the ceremonies of Hajj) performed before or after its due time, his reply was: \"Do it (now) and there is no harm.\""}, {"id": 83, "name": " 84 ", "group": "hadith", "level": 4, "text": " Narrated Ibn `Abbas:                     Somebody said to the Prophet (during his last Hajj), \"I did the slaughtering before doing the Rami.' The Prophet beckoned with his hand and said, \"There is no harm in that.\" Then another person said. \"I got my head shaved before offering the sacrifice.\" The Prophet beckoned with his hand saying, \"There is no harm in that.\""}, {"id": 84, "name": " 85 ", "group": "hadith", "level": 4, "text": " Narrated Abu Huraira:                     The Prophet said, \"(Religious) knowledge will be taken away (by the death of religious scholars) ignorance (in religion) and afflictions will appear; and Harj will increase.\" It was asked, \"What is Harj, O Allah's Apostle?\" He replied by beckoning with his hand indicating \"killing.\" (Fath-al-Bari Page 192, Vol. 1)"}, {"id": 85, "name": " 86 ", "group": "hadith", "level": 4, "text": " Narrated Asma':                     I came to `Aisha while she was praying, and said to her, \"What has happened to the people?\" She pointed out towards the sky. (I looked towards the mosque), and saw the people offering the prayer. Aisha said, \"Subhan Allah.\" I said to her, \"Is there a sign?\" She nodded with her head meaning, \"Yes.\" I, too, then stood (for the prayer of eclipse) till I became (nearly) unconscious and later on I poured water on my head. After the prayer, the Prophet praised and glorified Allah and then said, \"Just now at this place I have seen what I have never seen before, including Paradise and Hell. No doubt it has been inspired to me that you will be put to trials in your graves and these trials will be like the trials of Masih-ad-Dajjal or nearly like it (the sub narrator is not sure which expression Asma' used). You will be asked, 'What do you know about this man (the Prophet Muhammad)?' Then the faithful believer (or Asma' said a similar word) will reply, 'He is Muhammad Allah's Apostle who had come to us with clear evidences and guidance and so we accepted his teachings and followed him. And he is Muhammad.' And he will repeat it thrice. Then the angels will say to him, 'Sleep in peace as we have come to know that you were a faithful believer.' On the other hand, a hypocrite or a doubtful person will reply, 'I do not know, but I heard the people saying something and so I said it.' (the same). \""}, {"id": 86, "name": " 87 ", "group": "hadith", "level": 4, "text": " Narrated Abu Jamra:                     I was an interpreter between the people and Ibn `Abbas. Once Ibn `Abbas said that a delegation of the tribe of `Abdul Qais came to the Prophet who asked them, \"Who are the people (i.e. you)? (Or) who are the delegates?\" They replied, \"We are from the tribe of Rabi`a.\" Then the Prophet said to them, \"Welcome, O people (or said, \"O delegation (of `Abdul Qais).\") Neither will you have disgrace nor will you regret.\" They said, \"We have come to you from a distant place and there is the tribe of the infidels of Mudar intervening between you and us and we cannot come to you except in the sacred month. So please order us to do something good (religious deeds) and that we may also inform our people whom we have left behind (at home) and that we may enter Paradise (by acting on them.)\" The Prophet ordered them to do four things, and forbade them from four things. He ordered them to believe in Allah Alone, the Honorable the Majestic and said to them, \"Do you know what is meant by believing in Allah Alone?\" They replied, \"Allah and His Apostle know better.\" Thereupon the Prophet said, \"(That means to testify that none has the right to be worshipped but Allah and that Muhammad is His Apostle, to offer prayers perfectly, to pay Zakat, to observe fasts during the month of Ramadan, (and) to pay Al-Khumus (one fifth of the booty to be given in Allah's cause).\" Then he forbade them four things, namely Ad-Dubba.' Hantam, Muzaffat (and) An-Naqir or Muqaiyar (These were the names of pots in which alcoholic drinks used to be prepared). The Prophet further said, \"Memorize them (these instructions) and tell them to the people whom you have left behind.\""}, {"id": 87, "name": " 88 ", "group": "hadith", "level": 4, "text": " Narrated `Abdullah bin Abi Mulaika:                     `Uqba bin Al-Harith said that he had married the daughter of Abi Ihab bin `Aziz. Later on a woman came to him and said, \"I have suckled (nursed) `Uqba and the woman whom he married (his wife) at my breast.\" `Uqba said to her, \"Neither I knew that you have suckled (nursed) me nor did you tell me.\" Then he rode over to see Allah's Apostle at Medina, and asked him about it. Allah's Apostle said, \"How can you keep her as a wife when it has been said (that she is your foster-sister)?\" Then `Uqba divorced her, and she married another man."}, {"id": 88, "name": " 89 ", "group": "hadith", "level": 4, "text": " Narrated `Umar:                     My Ansari neighbor from Bani Umaiya bin Zaid who used to live at `Awali Al-Medina and used to visit the Prophet by turns. He used to go one day and I another day. When I went I used to bring the news of that day regarding the Divine Inspiration and other things, and when he went, he used to do the same for me. Once my Ansari friend, in his turn (on returning from the Prophet), knocked violently at my door and asked if I was there.\" I became horrified and came out to him. He said, \"Today a great thing has happened.\" I then went to Hafsa and saw her weeping. I asked her, \"Did Allah's Apostle divorce you all?\" She replied, \"I do not know.\" Then, I entered upon the Prophet and said while standing, \"Have you divorced your wives?\" The Prophet replied in the negative. On what I said, \"Allahu-Akbar (Allah is Greater).\" (See Hadith No. 119, Vol. 3 for details)"}, {"id": 89, "name": " 90 ", "group": "hadith", "level": 4, "text": " Narrated Abu Mas`ud Al-Ansari:                     Once a man said to Allah's Apostle \"O Allah's Apostle! I may not attend the (compulsory congregational) prayer because so and so (the Imam) prolongs the prayer when he leads us for it. The narrator added: \"I never saw the Prophet more furious in giving advice than he was on that day. The Prophet said, \"O people! Some of you make others dislike good deeds (the prayers). So whoever leads the people in prayer should shorten it because among them there are the sick the weak and the needy (having some jobs to do)."}, {"id": 90, "name": " 91 ", "group": "hadith", "level": 4, "text": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked the Prophet about the picking up of a \"Luqata\" (fallen lost thing). The Prophet replied, \"Recognize and remember its tying material and its container, and make public announcement (about it) for one year, then utilize it but give it to its owner if he comes.\" Then the person asked about the lost camel. On that, the Prophet got angry and his cheeks or his Face became red and he said, \"You have no concern with it as it has its water container, and its feet and it will reach water, and eat (the leaves) of trees till its owner finds it.\" The man then asked about the lost sheep. The Prophet replied, \"It is either for you, for your brother (another person) or for the wolf.\""}, {"id": 91, "name": " 92 ", "group": "hadith", "level": 4, "text": " Narrated Abu Musa:                     The Prophet was asked about things which he did not like, but when the questioners insisted, the Prophet got angry. He then said to the people, \"Ask me anything you like.\" A man asked, \"Who is my father?\" The Prophet replied, \"Your father is Hudhafa.\" Then another man got up and said, \"Who is my father, O Allah's Apostle ?\" He replied, \"Your father is Salim, Maula (the freed slave) of Shaiba.\" So when `Umar saw that (the anger) on the face of the Prophet he said, \"O Allah's Apostle! We repent to Allah (Our offending you)."}, {"id": 92, "name": " 93 ", "group": "hadith", "level": 4, "text": " Narrated Anas bin Malik:                     One day Allah's Apostle came out (before the people) and `Abdullah bin Hudhafa stood up and asked (him) \"Who is my father?\" The Prophet replied, \"Your father is Hudhafa.\" The Prophet told them repeatedly (in anger) to ask him anything they liked. `Umar knelt down before the Prophet and said thrice, \"We accept Allah as (our) Lord and Islam as (our) religion and Muhammad as (our) Prophet.\" After that the Prophet became silent."}, {"id": 93, "name": " 94 ", "group": "hadith", "level": 4, "text": " Narrated Anas:                     Whenever the Prophet asked permission to enter, he knocked the door thrice with greeting and whenever he spoke a sentence (said a thing) he used to repeat it thrice. (See Hadith No. 261, Vol. 8)."}, {"id": 94, "name": " 95 ", "group": "hadith", "level": 4, "text": " Narrated Anas:                     Whenever the Prophet spoke a sentence (said a thing), he used to repeat it thrice so that the people could understand it properly from him and whenever he asked permission to enter, (he knocked the door) thrice with greeting."}, {"id": 95, "name": " 96 ", "group": "hadith", "level": 4, "text": " Narrated `Abdullah bin `Amr:                     Once Allah's Apostle remained behind us in a journey. He joined us while we were performing ablution for the `Asr prayer which was over-due. We were just passing wet hands over our feet (not washing them properly) so the Prophet addressed us in a loud voice and said twice or thrice, \"Save your heels from the fire.\""}, {"id": 96, "name": " 97 ", "group": "hadith", "level": 4, "text": "      Narrated Abu Burda's father:                          Allah's Apostle said \"Three persons will have a double reward:     1. A Person from the people of the scriptures who believed in his      prophet (Jesus or Moses) and then believed in the Prophet Muhammad (i      .e. has embraced Islam).     2. A slave who discharges his duties to Allah and his master.     3. A master of a woman-slave who teaches her good manners and educates     her in the best possible way (the religion) and manumits her and then      marries her.\""}, {"id": 97, "name": " 98 ", "group": "hadith", "level": 4, "text": "      Narrated Ibn 'Abbas:                          Once Allah's Apostle came out while Bilal was accompanying him. He      went towards the women thinking that they had not heard him (i.e. his      sermon). So he preached them and ordered them to pay alms. (Hearing      that) the women started giving alms; some donated their ear-rings,      some gave their rings and Bilal was collecting them in the corner of      his garment."}, {"id": 98, "name": " 99 ", "group": "hadith", "level": 4, "text": " Narrated Abu Huraira:                     I said: \"O Allah's Apostle! Who will be the luckiest person, who will gain your intercession on the Day of Resurrection?\" Allah's Apostle said: O Abu Huraira! \"I have thought that none will ask me about it before you as I know your longing for the (learning of) Hadiths. The luckiest person who will have my intercession on the Day of Resurrection will be the one who said sincerely from the bottom of his heart \"None has the right to be worshipped but Allah.\""}, {"id": 99, "name": " 100 ", "group": "hadith", "level": 4, "text": " Narrated `Abdullah bin `Amr bin Al-`As:                     I heard Allah's Apostle saying, \"Allah does not take away the knowledge, by taking it away from (the hearts of) the people, but takes it away by the death of the religious learned men till when none of the (religious learned men) remains, people will take as their leaders ignorant persons who when consulted will give their verdict without knowledge. So they will go astray and will lead the people astray.\""}, {"id": 100, "name": " 101 ", "group": "hadith", "level": 4, "text": " Narrated Abu Sa`id Al-Khudri:                     Some women requested the Prophet to fix a day for them as the men were taking all his time. On that he promised them one day for religious lessons and commandments. Once during such a lesson the Prophet said, \"A woman whose three children die will be shielded by them from the Hell fire.\" On that a woman asked, \"If only two die?\" He replied, \"Even two (will shield her from the Hell-fire)."}, {"id": "30418", "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي", "group": "rawis", "level": 5}, {"id": "20005", "name": "Sufyan bin 'Uyaynah سفيان بن عيينة", "group": "rawis", "level": 5}, {"id": "30355", "name": "'Abdullah bin Yusuf al-Tunaysi عبد الله بن يوسف التنيسي", "group": "rawis", "level": 5}, {"id": "20001", "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر", "group": "rawis", "level": 5}, {"id": "30399", "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير", "group": "rawis", "level": 5}, {"id": "20023", "name": "al-Laith bin Sa'd الليث بن سعد", "group": "rawis", "level": 5}, {"id": "11013", "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم", "group": "rawis", "level": 5}, {"id": "10567", "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف", "group": "rawis", "level": 5}, {"id": "20040", "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي", "group": "rawis", "level": 5}, {"id": "20469", "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري  أبو عوانة", "group": "rawis", "level": 5}, {"id": "30349", "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان", "group": "rawis", "level": 5}, {"id": "20025", "name": "'Abdullah bin Mubarak عبد الله بن المبارك", "group": "rawis", "level": 5}, {"id": "30330", "name": "al-Hakm bin Nafi', Abu al-Yaman الحكم بن نافع أبو اليمان الحمصي", "group": "rawis", "level": 5}, {"id": "20428", "name": "Shu'aib bin Abi Hamza شعيب بن أبي حمزة", "group": "rawis", "level": 5}, {"id": "20340", "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام", "group": "rawis", "level": 5}, {"id": "11243", "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن", "group": "rawis", "level": 5}, {"id": "30351", "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي", "group": "rawis", "level": 5}, {"id": "20443", "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي", "group": "rawis", "level": 5}, {"id": "20404", "name": "Aadm bin Abi Iyas آدم بن أبي إياس", "group": "rawis", "level": 5}, {"id": "20020", "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج", "group": "rawis", "level": 5}, {"id": "30254", "name": "Sa'id bin Yahya bin Sa'id bin Aban سعيد بن يحيى بن سعيد بن أبان", "group": "rawis", "level": 5}, {"id": "20367", "name": "Yahya bin Sa'id bin Aban bin Sa'id يحيى بن سعيد بن أبان بن سعيد", "group": "rawis", "level": 5}, {"id": "30237", "name": "'Amr bin Khalid al-Hirani عمرو بن خالد بن فروخ بن سعيد", "group": "rawis", "level": 5}, {"id": "30175", "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل", "group": "rawis", "level": 5}, {"id": "20031", "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان", "group": "rawis", "level": 5}, {"id": "20184", "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم", "group": "rawis", "level": 5}, {"id": "20208", "name": "20208", "group": "rawis", "level": 5}, {"id": "30170", "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن", "group": "rawis", "level": 5}, {"id": "20259", "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي", "group": "rawis", "level": 5}, {"id": "20296", "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك  أبو الوليد الطيالسي", "group": "rawis", "level": 5}, {"id": "20164", "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي", "group": "rawis", "level": 5}, {"id": "30376", "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير", "group": "rawis", "level": 5}, {"id": "20337", "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي", "group": "rawis", "level": 5}, {"id": "20193", "name": "Sulaiman bin Harb سليمان بن حرب", "group": "rawis", "level": 5}, {"id": "30103", "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس", "group": "rawis", "level": 5}, {"id": "30213", "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي", "group": "rawis", "level": 5}, {"id": "20150", "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم", "group": "rawis", "level": 5}, {"id": "20221", "name": "Harmy bin 'Umarah حرمي بن عمارة بن أبي حفصة", "group": "rawis", "level": 5}, {"id": "30184", "name": "30184", "group": "rawis", "level": 5}, {"id": "30367", "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل", "group": "rawis", "level": 5}, {"id": "30147", "name": "'Abdur Rahman bin al-Mubarak al-'Aishi عبد الرحمن بن المبارك", "group": "rawis", "level": 5}, {"id": "20022", "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق", "group": "rawis", "level": 5}, {"id": "30137", "name": "Sulaiman bin Da'ud al-'Atki al-Zahrani سليمان بن داود أبو الربيع الزهراني", "group": "rawis", "level": 5}, {"id": "20155", "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري", "group": "rawis", "level": 5}, {"id": "20351", "name": "Qabaysa bin 'Uqba bin Muhammad قبيصة بن عقبة بن محمد بن سفيان", "group": "rawis", "level": 5}, {"id": "20012", "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري", "group": "rawis", "level": 5}, {"id": "30129", "name": "Harmy bin Hafs bin 'Umar حرمي بن حفص", "group": "rawis", "level": 5}, {"id": "20256", "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي", "group": "rawis", "level": 5}, {"id": "20356", "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان", "group": "rawis", "level": 5}, {"id": "20249", "name": "Abd al-Salam bin Mthr عبد السلام بن مطهر بن حسام", "group": "rawis", "level": 5}, {"id": "20265", "name": "'Umar bin 'Ali bin Ata'a bin Maqaddam عمر بن علي بن عطاء بن مقدم", "group": "rawis", "level": 5}, {"id": "20321", "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج", "group": "rawis", "level": 5}, {"id": "11163", "name": "Zayd bin Aslam زيد بن أسلم", "group": "rawis", "level": 5}, {"id": "30313", "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج", "group": "rawis", "level": 5}, {"id": "20121", "name": "'Abdur-Razzaq عبد الرزاق بن همام", "group": "rawis", "level": 5}, {"id": "20285", "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي", "group": "rawis", "level": 5}, {"id": "20295", "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي", "group": "rawis", "level": 5}, {"id": "30244", "name": "al-Hasan bin al-Sbah al-Bzar الحسن بن الصباح البزار", "group": "rawis", "level": 5}, {"id": "20416", "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر", "group": "rawis", "level": 5}, {"id": "30302", "name": "Ahmed bin 'Abdullah أحمد بن عبد الله بن علي", "group": "rawis", "level": 5}, {"id": "20229", "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء", "group": "rawis", "level": 5}, {"id": "20282", "name": "Muhammad bin 'Ar'ara محمد بن عرعرة", "group": "rawis", "level": 5}, {"id": "30101", "name": "Ibrahim bin Hamza bin Muhammad إبراهيم بن حمزة بن محمد", "group": "rawis", "level": 5}, {"id": "20348", "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي", "group": "rawis", "level": 5}, {"id": "11338", "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد", "group": "rawis", "level": 5}, {"id": "20386", "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري", "group": "rawis", "level": 5}, {"id": "20219", "name": "Hajjaj bin al-Minhal حجاج بن المنهال", "group": "rawis", "level": 5}, {"id": "20283", "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم", "group": "rawis", "level": 5}, {"id": "34207", "name": "Muhammad bin Snan bin Yazid محمد بن سنان بن يزيد", "group": "rawis", "level": 5}, {"id": "20169", "name": "Falayh bin Suliaman فليح بن سليمان", "group": "rawis", "level": 5}, {"id": "30463", "name": "Khalid bin Mukhallad al-Qatwani خالد بن مخلد القطواني", "group": "rawis", "level": 5}, {"id": "20160", "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي", "group": "rawis", "level": 5}, {"id": "30118", "name": "Muhammad bin Maqatil al-Kisa'i محمد بن مقاتل الكسائي رخ", "group": "rawis", "level": 5}, {"id": "20212", "name": "20212", "group": "rawis", "level": 5}, {"id": "30388", "name": "Muhammad bin Yusuf al-Baykandi محمد بن يوسف البيكندي البخاري", "group": "rawis", "level": 5}, {"id": "30160", "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار", "group": "rawis", "level": 5}, {"id": "30203", "name": "'Uthman bin Muhammad (Abi Shayba) عثمان بن محمد بن إبراهيم / بن أبي شيبة", "group": "rawis", "level": 5}, {"id": "20028", "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي", "group": "rawis", "level": 5}, {"id": "30233", "name": "Sa'id bin Kathir bin 'Afayr سعيد بن كثير بن عفير", "group": "rawis", "level": 5}, {"id": "20029", "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي", "group": "rawis", "level": 5}, {"id": "30026", "name": "'Ali bin al-Madini علي بن المديني", "group": "rawis", "level": 5}, {"id": "30109", "name": "Muhammad bin Gharir محمد بن غرير", "group": "rawis", "level": 5}, {"id": "30315", "name": "Isma'il bin Ibrahim,Abu Ma'mar al-Hadhli إسماعيل بن إبراهيم بن معمر أبو معمر", "group": "rawis", "level": 5}, {"id": "20258", "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان", "group": "rawis", "level": 5}, {"id": "30284", "name": "'Abdul A'ala bin Mushir al-Ghasani عبد الأعلى بن مسهر أبو مسهر الغساني", "group": "rawis", "level": 5}, {"id": "30333", "name": "Khalid bin Khly خالد بن خلي", "group": "rawis", "level": 5}, {"id": "30373", "name": "Muhammad bin Harb al-Wasti محمد بن حرب بن حرمان النشائي", "group": "rawis", "level": 5}, {"id": "30216", "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب", "group": "rawis", "level": 5}, {"id": "20318", "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة", "group": "rawis", "level": 5}, {"id": "30156", "name": "'Imran bin Mysrh عمران بن ميسرة", "group": "rawis", "level": 5}, {"id": "20299", "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي", "group": "rawis", "level": 5}, {"id": "20202", "name": "Makki bin Ibrahim bin Bashayr مكي بن إبراهيم بن بشير", "group": "rawis", "level": 5}, {"id": "20278", "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس", "group": "rawis", "level": 5}, {"id": "28531", "name": "Muhammad bin Kathir bin Abi 'Ata' محمد بن كثير بن أبي عطاء الثقفي", "group": "rawis", "level": 5}, {"id": "20250", "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد", "group": "rawis", "level": 5}, {"id": "30149", "name": "'Abdah bin 'Abdullah al-Saffar عبدة بن عبد الله الصفار", "group": "rawis", "level": 5}, {"id": "20333", "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي", "group": "rawis", "level": 5}, {"id": "30105", "name": "'Abdul 'Aziz bin 'Abdullah al-Uvaisi عبد العزيز بن عبد الله بن يحيى  الأويسي", "group": "rawis", "level": 5}], "links": [{"source": "hadiths", "target": " Sahih Bukhari "}, {"source": " Sahih Bukhari ", "target": "Revelation - كتاب بدء الوحى"}, {"source": "Revelation - كتاب بدء الوحى", "target": 0}, {"source": " Sahih Bukhari ", "target": "Revelation - كتاب بدء الوحى"}, {"source": "Revelation - كتاب بدء الوحى", "target": 1}, {"source": " Sahih Bukhari ", "target": "Revelation - كتاب بدء الوحى"}, {"source": "Revelation - كتاب بدء الوحى", "target": 2}, {"source": " Sahih Bukhari ", "target": "Revelation - كتاب بدء الوحى"}, {"source": "Revelation - كتاب بدء الوحى", "target": 3}, {"source": " Sahih Bukhari ", "target": "Revelation - كتاب بدء الوحى"}, {"source": "Revelation - كتاب بدء الوحى", "target": 4}, {"source": " Sahih Bukhari ", "target": "Revelation - كتاب بدء الوحى"}, {"source": "Revelation - كتاب بدء الوحى", "target": 5}, {"source": " Sahih Bukhari ", "target": "Revelation - كتاب بدء الوحى"}, {"source": "Revelation - كتاب بدء الوحى", "target": 6}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 7}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 8}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 9}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 10}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 11}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 12}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 13}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 14}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 15}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 16}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 17}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 18}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 19}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 20}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 21}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 22}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 23}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 24}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 25}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 26}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 27}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 28}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 29}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 30}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 31}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 32}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 33}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 34}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 35}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 36}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 37}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 38}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 39}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 40}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 41}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 42}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 43}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 44}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 45}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 46}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 47}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 48}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 49}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 50}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 51}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 52}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 53}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 54}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 55}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 56}, {"source": " Sahih Bukhari ", "target": "Belief - كتاب الإيمان"}, {"source": "Belief - كتاب الإيمان", "target": 57}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 58}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 59}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 60}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 61}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 62}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 63}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 64}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 65}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 66}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 67}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 68}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 69}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 70}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 71}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 72}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 73}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 74}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 75}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 76}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 77}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 78}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 79}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 80}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 81}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 82}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 83}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 84}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 85}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 86}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 87}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 88}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 89}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 90}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 91}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 92}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 93}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 94}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 95}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 96}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 97}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 98}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 99}, {"source": " Sahih Bukhari ", "target": "Knowledge - كتاب العلم"}, {"source": "Knowledge - كتاب العلم", "target": 100}, {"source": 0, "target": "30418"}, {"source": "30418", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": 1, "target": "30355"}, {"source": "30355", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 2, "target": "30399"}, {"source": "30399", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": 3, "target": "11013"}, {"source": "11013", "target": "10567"}, {"source": "10567", "target": "10567"}, {"source": 4, "target": "20040"}, {"source": "20040", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": 5, "target": "30349"}, {"source": "30349", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": 6, "target": "30330"}, {"source": "30330", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": 7, "target": "20340"}, {"source": "20340", "target": "11243"}, {"source": "11243", "target": "11243"}, {"source": "11243", "target": "11243"}, {"source": 8, "target": "30351"}, {"source": "30351", "target": "20443"}, {"source": "20443", "target": "20443"}, {"source": "20443", "target": "20443"}, {"source": "20443", "target": "20443"}, {"source": "20443", "target": "20443"}, {"source": 9, "target": "20404"}, {"source": "20404", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": 10, "target": "30254"}, {"source": "30254", "target": "20367"}, {"source": "20367", "target": "20367"}, {"source": "20367", "target": "20367"}, {"source": "20367", "target": "20367"}, {"source": 11, "target": "30237"}, {"source": "30237", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": 12, "target": "30175"}, {"source": "30175", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": 13, "target": "30330"}, {"source": "30330", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": 14, "target": "20184"}, {"source": "20184", "target": "20208"}, {"source": "20208", "target": "20208"}, {"source": "20208", "target": "20208"}, {"source": 15, "target": "30170"}, {"source": "30170", "target": "20259"}, {"source": "20259", "target": "20259"}, {"source": "20259", "target": "20259"}, {"source": "20259", "target": "20259"}, {"source": 16, "target": "20296"}, {"source": "20296", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": 17, "target": "30330"}, {"source": "30330", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": 18, "target": "20164"}, {"source": "20164", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 19, "target": "30376"}, {"source": "30376", "target": "20337"}, {"source": "20337", "target": "20337"}, {"source": "20337", "target": "20337"}, {"source": "20337", "target": "20337"}, {"source": 20, "target": "20193"}, {"source": "20193", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": 21, "target": "30103"}, {"source": "30103", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 22, "target": "30213"}, {"source": "30213", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": 23, "target": "30355"}, {"source": "30355", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 24, "target": "30351"}, {"source": "30351", "target": "20221"}, {"source": "20221", "target": "20221"}, {"source": "20221", "target": "20221"}, {"source": "20221", "target": "20221"}, {"source": "20221", "target": "20221"}, {"source": 25, "target": "30184"}, {"source": "30184", "target": "20040"}, {"source": "20040", "target": "20040"}, {"source": "20040", "target": "20040"}, {"source": "20040", "target": "20040"}, {"source": "20040", "target": "20040"}, {"source": 26, "target": "30330"}, {"source": "30330", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": 27, "target": "30367"}, {"source": "30367", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": 28, "target": "20164"}, {"source": "20164", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 29, "target": "20193"}, {"source": "20193", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": 30, "target": "30147"}, {"source": "30147", "target": "20022"}, {"source": "20022", "target": "20022"}, {"source": "20022", "target": "20022"}, {"source": "20022", "target": "20022"}, {"source": "20022", "target": "20022"}, {"source": "20022", "target": "20022"}, {"source": 31, "target": "20296"}, {"source": "20296", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": 32, "target": "30137"}, {"source": "30137", "target": "20155"}, {"source": "20155", "target": "20155"}, {"source": "20155", "target": "20155"}, {"source": "20155", "target": "20155"}, {"source": 33, "target": "20351"}, {"source": "20351", "target": "20012"}, {"source": "20012", "target": "20012"}, {"source": "20012", "target": "20012"}, {"source": "20012", "target": "20012"}, {"source": "20012", "target": "20012"}, {"source": 34, "target": "30330"}, {"source": "30330", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": 35, "target": "30129"}, {"source": "30129", "target": "20256"}, {"source": "20256", "target": "20256"}, {"source": "20256", "target": "20256"}, {"source": "20256", "target": "20256"}, {"source": 36, "target": "30103"}, {"source": "30103", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 37, "target": "30376"}, {"source": "30376", "target": "20356"}, {"source": "20356", "target": "20356"}, {"source": "20356", "target": "20356"}, {"source": "20356", "target": "20356"}, {"source": 38, "target": "20249"}, {"source": "20249", "target": "20265"}, {"source": "20265", "target": "20265"}, {"source": "20265", "target": "20265"}, {"source": "20265", "target": "20265"}, {"source": 39, "target": "30237"}, {"source": "30237", "target": "20321"}, {"source": "20321", "target": "20321"}, {"source": "20321", "target": "20321"}, {"source": 40, "target": "20001"}, {"source": "20001", "target": "11163"}, {"source": "11163", "target": "11163"}, {"source": "11163", "target": "11163"}, {"source": 41, "target": "30313"}, {"source": "30313", "target": "20121"}, {"source": "20121", "target": "20121"}, {"source": "20121", "target": "20121"}, {"source": "20121", "target": "20121"}, {"source": 42, "target": "30170"}, {"source": "30170", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": 43, "target": "20285"}, {"source": "20285", "target": "20295"}, {"source": "20295", "target": "20295"}, {"source": "20295", "target": "20295"}, {"source": 44, "target": "30244"}, {"source": "30244", "target": "20416"}, {"source": "20416", "target": "20416"}, {"source": "20416", "target": "20416"}, {"source": "20416", "target": "20416"}, {"source": "20416", "target": "20416"}, {"source": 45, "target": "30103"}, {"source": "30103", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 46, "target": "30302"}, {"source": "30302", "target": "20229"}, {"source": "20229", "target": "20229"}, {"source": "20229", "target": "20229"}, {"source": "20229", "target": "20229"}, {"source": "20229", "target": "20229"}, {"source": 47, "target": "20282"}, {"source": "20282", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": 48, "target": "30367"}, {"source": "30367", "target": "20155"}, {"source": "20155", "target": "20155"}, {"source": "20155", "target": "20155"}, {"source": "20155", "target": "20155"}, {"source": 49, "target": "30175"}, {"source": "30175", "target": "20208"}, {"source": "20208", "target": "20208"}, {"source": "20208", "target": "20208"}, {"source": "20208", "target": "20208"}, {"source": 50, "target": "30101"}, {"source": "30101", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": 51, "target": "20348"}, {"source": "20348", "target": "11338"}, {"source": "11338", "target": "11338"}, {"source": "11338", "target": "11338"}, {"source": 52, "target": "20386"}, {"source": "20386", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": 53, "target": "20164"}, {"source": "20164", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 54, "target": "20219"}, {"source": "20219", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": 55, "target": "30330"}, {"source": "30330", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": 56, "target": "30175"}, {"source": "30175", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": 57, "target": "20283"}, {"source": "20283", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": 58, "target": "34207"}, {"source": "34207", "target": "20169"}, {"source": "20169", "target": "20169"}, {"source": "20169", "target": "20169"}, {"source": "20169", "target": "20169"}, {"source": "20169", "target": "20169"}, {"source": "20169", "target": "20169"}, {"source": "20169", "target": "20169"}, {"source": 59, "target": "20283"}, {"source": "20283", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": 60, "target": "30367"}, {"source": "30367", "target": "20155"}, {"source": "20155", "target": "20155"}, {"source": "20155", "target": "20155"}, {"source": 61, "target": "30463"}, {"source": "30463", "target": "20160"}, {"source": "20160", "target": "20160"}, {"source": "20160", "target": "20160"}, {"source": 62, "target": "30355"}, {"source": "30355", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": 63, "target": "30103"}, {"source": "30103", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": "20150", "target": "20150"}, {"source": 64, "target": "30118"}, {"source": "30118", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": 65, "target": "30103"}, {"source": "30103", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 66, "target": "30175"}, {"source": "30175", "target": "20212"}, {"source": "20212", "target": "20212"}, {"source": "20212", "target": "20212"}, {"source": "20212", "target": "20212"}, {"source": "20212", "target": "20212"}, {"source": 67, "target": "30388"}, {"source": "30388", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": 68, "target": "30160"}, {"source": "30160", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": 69, "target": "30203"}, {"source": "30203", "target": "20028"}, {"source": "20028", "target": "20028"}, {"source": "20028", "target": "20028"}, {"source": "20028", "target": "20028"}, {"source": 70, "target": "30233"}, {"source": "30233", "target": "20029"}, {"source": "20029", "target": "20029"}, {"source": "20029", "target": "20029"}, {"source": "20029", "target": "20029"}, {"source": "20029", "target": "20029"}, {"source": 71, "target": "30026"}, {"source": "30026", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": 72, "target": "30418"}, {"source": "30418", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": "20005", "target": "20005"}, {"source": 73, "target": "30109"}, {"source": "30109", "target": "20184"}, {"source": "20184", "target": "20184"}, {"source": "20184", "target": "20184"}, {"source": "20184", "target": "20184"}, {"source": "20184", "target": "20184"}, {"source": "20184", "target": "20184"}, {"source": 74, "target": "30315"}, {"source": "30315", "target": "20258"}, {"source": "20258", "target": "20258"}, {"source": "20258", "target": "20258"}, {"source": "20258", "target": "20258"}, {"source": 75, "target": "30103"}, {"source": "30103", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 76, "target": "30388"}, {"source": "30388", "target": "30284"}, {"source": "30284", "target": "30284"}, {"source": "30284", "target": "30284"}, {"source": "30284", "target": "30284"}, {"source": "30284", "target": "30284"}, {"source": 77, "target": "30333"}, {"source": "30333", "target": "30373"}, {"source": "30373", "target": "30373"}, {"source": "30373", "target": "30373"}, {"source": "30373", "target": "30373"}, {"source": "30373", "target": "30373"}, {"source": 78, "target": "30216"}, {"source": "30216", "target": "20318"}, {"source": "20318", "target": "20318"}, {"source": "20318", "target": "20318"}, {"source": "20318", "target": "20318"}, {"source": 79, "target": "30156"}, {"source": "30156", "target": "20258"}, {"source": "20258", "target": "20258"}, {"source": "20258", "target": "20258"}, {"source": 80, "target": "30175"}, {"source": "30175", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": "20031", "target": "20031"}, {"source": 81, "target": "30233"}, {"source": "30233", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": "20023", "target": "20023"}, {"source": 82, "target": "30103"}, {"source": "30103", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 83, "target": "20040"}, {"source": "20040", "target": "20299"}, {"source": "20299", "target": "20299"}, {"source": "20299", "target": "20299"}, {"source": "20299", "target": "20299"}, {"source": 84, "target": "20202"}, {"source": "20202", "target": "11243"}, {"source": "11243", "target": "11243"}, {"source": "11243", "target": "11243"}, {"source": 85, "target": "20040"}, {"source": "20040", "target": "20299"}, {"source": "20299", "target": "20299"}, {"source": "20299", "target": "20299"}, {"source": "20299", "target": "20299"}, {"source": 86, "target": "30160"}, {"source": "30160", "target": "20278"}, {"source": "20278", "target": "20278"}, {"source": "20278", "target": "20278"}, {"source": 87, "target": "30118"}, {"source": "30118", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": "20025", "target": "20025"}, {"source": 88, "target": "30330"}, {"source": "30330", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": 89, "target": "28531"}, {"source": "28531", "target": "20012"}, {"source": "20012", "target": "20012"}, {"source": "20012", "target": "20012"}, {"source": "20012", "target": "20012"}, {"source": 90, "target": "30351"}, {"source": "30351", "target": "20443"}, {"source": "20443", "target": "20443"}, {"source": "20443", "target": "20443"}, {"source": "20443", "target": "20443"}, {"source": "20443", "target": "20443"}, {"source": 91, "target": "30216"}, {"source": "30216", "target": "20318"}, {"source": "20318", "target": "20318"}, {"source": "20318", "target": "20318"}, {"source": "20318", "target": "20318"}, {"source": 92, "target": "30330"}, {"source": "30330", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": "20428", "target": "20428"}, {"source": 93, "target": "20337"}, {"source": "20337", "target": "20250"}, {"source": "20250", "target": "20250"}, {"source": "20250", "target": "20250"}, {"source": "20250", "target": "20250"}, {"source": 94, "target": "30149"}, {"source": "30149", "target": "20250"}, {"source": "20250", "target": "20250"}, {"source": "20250", "target": "20250"}, {"source": "20250", "target": "20250"}, {"source": 95, "target": "30175"}, {"source": "30175", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": "20469", "target": "20469"}, {"source": 96, "target": "30376"}, {"source": "30376", "target": "20333"}, {"source": "20333", "target": "20333"}, {"source": "20333", "target": "20333"}, {"source": "20333", "target": "20333"}, {"source": "20333", "target": "20333"}, {"source": 97, "target": "20193"}, {"source": "20193", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": 98, "target": "30105"}, {"source": "30105", "target": "20160"}, {"source": "20160", "target": "20160"}, {"source": "20160", "target": "20160"}, {"source": "20160", "target": "20160"}, {"source": 99, "target": "30103"}, {"source": "30103", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": "20001", "target": "20001"}, {"source": 100, "target": "20404"}, {"source": "20404", "target": "20020"}, {"source": "20020", "target": "20020"}, {"source": "20020", "target": "20020"}]}